In [1]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import numpy as np

In [16]:
df = pd.read_csv('../../datos/attacks_limpio_3.csv', index_col=0)

In [4]:
df.head(2)

,case_number,year,mes,country,type,area,activity,age,sex,species,injury,fatal
0,1800.00.00,1976,NaN,seychelles,Unprovoked,St. Anne,a corsair's boat was overturned,NaN,F,NaN,"FATAL, all onboard were killed by sharks",y
1,1797.05.28.R,1976,May,NaN,Unprovoked,NaN,Dropped overboard,NaN,NaN,NaN,FATAL,y

In [6]:
df.shape

(6328, 12)

Lo primero que tenemos que evaluar es en que columnas tenemos nulos y qué cantidad tenemos en cada una. ¿Hay alguna columna con una gran cantidad de nulos? En caso de que sea así deberemos eliminarla.

In [17]:
df.isnull().sum()

case_number       1
year              0
mes             576
country          50
type              4
area            456
activity        544
age            2873
sex             569
species        5196
injury           28
fatal           619
dtype: int64

In [18]:
df.isnull().sum()*100/df.shape[0]

case_number     0.015803
year            0.000000
mes             9.102402
country         0.790139
type            0.063211
area            7.206068
activity        8.596713
age            45.401391
sex             8.991783
species        82.111252
injury          0.442478
fatal           9.781922
dtype: float64

Es el momento de eliminar los nulos:
- Reemplazad los valores nulos de la columna age por la media de la edad, redondeada a dos decimales.

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6328 entries, 0 to 6283
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   case_number  6327 non-null   object
 1   year         6328 non-null   int64
 2   mes          5752 non-null   object
 3   country      6278 non-null   object
 4   type         6324 non-null   object
 5   area         5872 non-null   object
 6   activity     5784 non-null   object
 7   age          3455 non-null   float64
 8   sex          5759 non-null   object
 9   species      1132 non-null   object
 10  injury       6300 non-null   object
 11  fatal        5709 non-null   object
dtypes: float64(1), int64(1), object(10)
memory usage: 642.7+ KB

In [20]:
df['age'].fillna(round((df['age'].mean()), 2),inplace = True)

In [21]:
df['age'].unique()

array([27.28, 14.  , 19.  , 20.  , 15.  , 21.  , 27.  , 36.  , 25.  ,
        6.  , 16.  , 50.  , 13.  , 57.  , 11.  , 48.  , 18.  , 52.  ,
       12.  , 32.  , 10.  , 34.  , 30.  , 60.  , 33.  , 29.  , 54.  ,
       41.  , 37.  , 56.  , 69.  , 38.  , 55.  , 35.  , 46.  , 45.  ,
       28.  , 24.  , 26.  , 49.  , 22.  ,  7.  , 31.  , 17.  , 40.  ,
       42.  ,  3.  ,  8.  , 82.  , 73.  , 68.  , 51.  , 39.  , 58.  ,
       47.  , 61.  , 65.  , 66.  , 43.  ,  9.  , 72.  , 59.  , 64.  ,
       23.  , 71.  , 44.  , 62.  , 63.  , 70.  , 53.  , 77.  , 74.  ,
        5.  , 86.  , 84.  , 75.  , 87.  , 67.  ,  1.  ,  2.  , 81.  ,
       78.  ])

In [22]:
# Podemos observar que los valores nulos se reemplazaron por la media que es igual a 27.28
df.sample(5)

,case_number,year,mes,country,type,area,activity,age,sex,species,injury,fatal
1406,2008.06.28.b,2008,Jun,bahamas,Unprovoked,Abaco Islands,Spearfishing,42.00,M,BULL SHARK,Lacerations to calf,n
2895,1988.05.27,1988,May,south korea,Unprovoked,NaN,Shell diving,38.00,F,NaN,FATAL,y
2380,1997.10.28.b,1997,Oct,australia,Unprovoked,Western Australia,Surf-skiing,51.00,M,WHITE SHARK,"Sierakowski suffered a minor facial injury, sk...",n
6031,1875.00.00,1875,NaN,australia,Unprovoked,Western Australia,Sitting on gunwale of boat,27.28,M,NaN,FATAL,y
4384,1956.10.27,1956,Oct,south africa,Unprovoked,Western Cape Province,Free diving for sinkers,29.00,M,WHITE SHARK,Right heel lacerated & swim fin removed by shark,n

- En relación a la columna de country al tratarse de una columna de tipo categórica, reemplazad los valores nulos por una nueva categória que se llame Unknown.

In [23]:
df['country'].replace(np.nan,'unknown', inplace=True)

In [24]:
df['country'].unique()

array(['seychelles', 'unknown', 'england', 'australia', 'barbados',
       'jamaica', 'martinique', 'usa', 'guinea', 'greenland', 'france',
       'spain', 'mediterranean sea', 'cuba', 'sweden', 'panama', 'italy',
       'iceland', 'roatan', 'india', 'between portugal & india',
       'venezuela', 'mexico', 'greece', 'canada', 'kenya', 'uruguay',
       'papua new guinea', 'bermuda', 'lebanon', 'sudan', 'djibouti',
       'libya', 'new zealand', 'vietnam', 'sri lanka', 'mozambique',
       'south africa', 'bahrein', 'bahamas', 'reunion', 'solomon islands',
       'korea', 'french polynesia', 'vanuatu', 'iran', 'red sea?',
       'singapore', 'fiji', 'iraq', 'madagascar', 'indonesia',
       'nicaragua', 'marshall islands', 'kiribati', 'north pacific ocean',
       'saudi arabia', 'pacific ocean', 'burma', 'belize', 'asia?',
       'ceylon (sri lanka)', 'brazil', 'thailand', 'costa rica',
       'maldives', 'new caledonia', 'ecuador', 'malaysia', 'mauritius',
       'samoa', 'japan', 'egypt', 'st helena, british overseas territory',
       'comoros', 'united kingdom', 'united arab emirates', 'philippines',
       'china', 'columbia', 'cape verde', 'dominican republic',
       'cayman islands', 'aruba', 'puerto rico', 'atlantic ocean',
       'st. martin', 'trinidad & tobago', 'israel', 'diego garcia',
       'taiwan', 'palestinian territories', 'guam', 'nigeria', 'tonga',
       'scotland', 'croatia', 'chile', 'antigua', 'russia',
       'turks & caicos', 'united arab emirates (uae)', 'azores',
       'south korea', 'malta', 'somalia', 'nevis',
       'british virgin islands', 'norway', 'senegal', 'yemen',
       'gulf of aden', 'sierra leone', 'st. maartin', 'grand cayman',
       'liberia', 'mexico ', ' tonga', 'micronesia', 'caribbean sea',
       'okinawa', 'tanzania', 'egypt / israel', 'northern arabian sea',
       'hong kong', 'el salvador', 'angola', 'montenegro', 'tunisia',
       'namibia', 'north atlantic ocean', 'portugal', 'south china sea',
       'bangladesh', 'palau', 'western samoa', 'pacific ocean ',
       'british isles', 'grenada', 'turkey', 'new britain',
       'johnston island', 'south pacific ocean', 'new guinea', 'red sea',
       'federated states of micronesia', 'mid atlantic ocean',
       'admiralty islands', 'british west indies', 'south atlantic ocean',
       'persian gulf', 'red sea / indian ocean', 'north sea',
       'nicaragua ', 'maldive islands', 'american samoa',
       'andaman / nicobar islandas', 'gabon', 'mayotte',
       'north atlantic ocean ', 'the balkans', 'sudan?', 'argentina',
       'indian ocean', 'guatemala', 'netherlands antilles',
       'northern mariana islands', 'iran / iraq', 'java', ' philippines',
       'central pacific', 'solomon islands / vanuatu',
       'southwest pacific ocean', 'bay of bengal', 'mid-pacifc ocean',
       'slovenia', 'curacao', 'italy / croatia', 'honduras', 'monaco',
       'guyana', 'haiti', 'san domingo', 'ireland', 'kuwait', 'yemen ',
       'reunion island', 'falkland islands', 'crete', 'cyprus', 'egypt ',
       'west indies', 'paraguay', 'british new guinea', 'ceylon', 'ocean',
       'georgia', 'syria', 'tuvalu', 'indian ocean?', 'andaman islands',
       'equatorial guinea / cameroon', 'cook islands', 'tobago', 'peru',
       'africa', 'algeria', 'coast of africa', 'tasman sea', 'ghana'],
      dtype=object)

- Reemplazad los valores nulos de la columna fatal por Unknown.

In [26]:
df['fatal'].replace(np.nan,'unknown', inplace=True)

In [27]:
df['fatal'].unique()

array(['y', 'n', 'unknown'], dtype=object)

- Reemplazad los valores nulos de la columna type por el valor más frecuente (la moda).

In [28]:
df['type'].mode()[0]

'Unprovoked'

In [29]:
# Reemplazando los nan con replace

df['type'].replace(np.nan,df['type'].mode()[0], inplace=True)

In [30]:
df['type'].unique()

array(['Unprovoked', 'Provoked', 'Boat', 'Sea Disaster', 'Invalid',
       'Boating', 'Questionable', 'Boatomg'], dtype=object)

In [31]:
# También se podrían reemplazar los nan con fillna

df['type'].fillna(df['type'].mode()[0], inplace=True)

In [32]:
df['type'].unique()

array(['Unprovoked', 'Provoked', 'Boat', 'Sea Disaster', 'Invalid',
       'Boating', 'Questionable', 'Boatomg'], dtype=object)

- Reemplazad los valores nulos de la columna fecha por Unknown.

In [33]:
# En nuestro caso la columna fecha se llama 'mes'
df['mes'].unique()

array([nan, 'May', 'Sep', 'Jul', 'Aug', 'Dec', 'Mar', 'Oct', 'Apr', 'Jan',
       'Jun', 'Feb', 'Nov', 'Mid'], dtype=object)

In [34]:
df['mes'].replace(np.nan,'Unknown', inplace=True)

In [35]:
df['mes'].unique()

array(['Unknown', 'May', 'Sep', 'Jul', 'Aug', 'Dec', 'Mar', 'Oct', 'Apr',
       'Jan', 'Jun', 'Feb', 'Nov', 'Mid'], dtype=object)

In [37]:
# Observamos cómo ha cambiado la cantidad de nulos en nuestras columnas

df.isnull().sum()

case_number       1
year              0
mes               0
country           0
type              0
area            456
activity        544
age               0
sex             569
species        5196
injury           28
fatal             0
dtype: int64

Guardad el csv para seguir trabajando con el en los siguientes ejercicios de pair.

In [36]:
df.to_csv('../../datos/attack_limpio_4.csv')